/* 아래의 SQL과 실행계획을 보고 튜닝하세요.
    - 인덱스 : 주문지역코드, 주문일자, 주문금액
    - 인덱스 수정 불가
    - SQL 수정 가능

테이블 구성
   고객번호	    VARCHAR2(17)
   주문금액	    NUMBER
   주문지역코드	VARCHAR2(8)
   주문일자	    VARCHAR2(8)
   C1	        VARCHAR2(40)
   C2	        VARCHAR2(40)
   C3	        VARCHAR2(40)
   C4	        VARCHAR2(40)
   C5	        VARCHAR2(40)
   C6	        VARCHAR2(40)

전체 건수    : 1,000만건
주문일자     : 2019.05.24 - 2019.08.31 (100일)
1일당 10만건
주문지역코드 : 1, 2, 3, 4, 5 (고르게 분포)
주문금액     : 1만원 - 100만원 (고르게 분포)

*/

SELECT  고객번호, 주문금액, 주문지역코드, 주문일자, C1, C2, C3
FROM t_주문14  A
WHERE 주문금액     BETWEEN 80000 AND 81000
  AND  주문지역코드 BETWEEN '01' AND '03'
  AND  주문일자     = '20190710';

/*
 답안
    주문지역의 BETWEEN 조건을 IN 조건으로 수정하여 명시적으로 선택하는 수평적 스캔
 */

SELECT  고객번호, 주문금액, 주문지역코드, 주문일자, C1, C2, C3
    FROM    T_주문14  A
    WHERE   주문금액    BETWEEN 80000 AND 81000
        AND    주문지역코드     IN ('01', '02', '03')
        AND    주문일자          = '20190710';

/*
---------------------------------------------------------------------------------------------
| Id  | Operation                   | Name         | Starts | A-Rows |   A-Time   | Buffers |
---------------------------------------------------------------------------------------------
|   0 | SELECT STATEMENT            |              |      1 |    100 |00:00:00.28 |   16589 |
|   1 |  TABLE ACCESS BY INDEX ROWID| T_주문14     |      1 |    100 |00:00:00.28 |   16589 |
|*  2 |   INDEX RANGE SCAN          | IX_T_주문14_0|      1 |    100 |00:00:00.28 |   16489 |
---------------------------------------------------------------------------------------------

Predicate Information (identified by operation id):
---------------------------------------------------

   2 - access("주문지역코드">='01' AND "주문일자"='20190710' AND "주문금액">=80000 AND
              "주문지역코드"<='03' AND "주문금액"<=81000)
       filter(("주문일자"='20190710' AND "주문금액">=80000 AND "주문금액"<=81000))
*/

/*
-------------------------------------------------------------------------------------------------------
| Id  | Operation                    | Name         | Starts | A-Rows |   A-Time   | Buffers | Reads  |
-------------------------------------------------------------------------------------------------------
|   0 | SELECT STATEMENT             |              |      1 |    100 |00:00:00.01 |     109 |     97 |
|   1 |  INLIST ITERATOR             |              |      1 |    100 |00:00:00.01 |     109 |     97 |
|   2 |   TABLE ACCESS BY INDEX ROWID| T_주문14     |      3 |    100 |00:00:00.01 |     109 |     97 |
|*  3 |    INDEX RANGE SCAN          | IX_T_주문14_0|      3 |    100 |00:00:00.01 |       9 |      1 |
-------------------------------------------------------------------------------------------------------
3 - access((("주문지역코드"='01' OR "주문지역코드"='02' OR "주문지역코드"='03')) AND "주문일자"='20190713' AND
           "주문금액">=80000 AND "주문금액"<=81000)
*/

/*

 */
ALTER SESSION SET STATISTICS_LEVEL = ALL;

SELECT * FROM TABLE(DBMS_XPLAN.DISPLAY_CURSOR(NULL, NULL, 'ALLSTATS LAST'));

SELECT * FROM TABLE(DBMS_XPLAN.DISPLAY_CURSOR(NULL, NULL, 'IOSTATS LAST -ROWS'));